package practice;

public class JAVA_03 {
	public static void main(String[] args) {
//		제어문
//
//		프로그램 실행 코드의 흐름을 제어하는 구문
//		조건문 : 조건에 따른 실행 흐름 분기
//		반복문 : 조건에 따른 특정 영역의 코드를 반복
//
//		if 조건문
//
//		조건에 따라 프로그램 코드 실행의 분기를 해주는 구문
//
//		단순 if 구문
//
//		조건이 참이면 종속문장 또는 종속블록({…}) 실행 거짓이면 실행 안 함
//		if (논리형 조건식)
//		실행문;
//
//		if (논리형 조건식){
//		실행문;
//		실행문;
//		...
//		}

//		Java의 제어문 사용 시 주의사항
//		제어문의 조건은 true/false 이어야 한다.

//		public static void main(String[] args) {
//			if(1){ //컴파일 에러!!
//		System.out.println("참이다.");
		
//		if~else 구문
//
//		if문의 조건이 참이면 if의 종속문장 실행
//		if문의 조건이 거짓이면 else의 종속문장 실행
//		둘 중 하나만 실행된다.
//
//		if (논리형 조건식)
//			실행문;
//		else
//			실행문;
//
//		if (논리형 조건식){
//			실행문;
//			실행문;
//			...
//		} else {
//			실행문;
//			실행문;
//			...
//		}
		

//		다중 if 구문
//		if ~ else if ~
//		여러 조건을 연결하여 참인 경우의 종속문장만 실행
//		마지막 else는 필요에 따라 사용 또는 미사용 할 수 있음
//		
//		if (논리형 조건식)
//			실행문;
//		else if(논리형 조건식)
//			실행문;
//		else if(논리형 조건식)
//			실행문;
//		else if(논리형 조건식)
//			...
//		else if(논리형 조건식 n)
//			실행문 n;
//		else //필요 시 사용
//			실행문;
		
		
	}
}
